//****************************************************************************
//****************************************************************************
//**                                                                        **
//**             (C)Copyright 1985-2014, American Megatrends, Inc.          **
//**                                                                        **
//**                          All Rights Reserved.                          **
//**                                                                        **
//**             5555 Oakbrook Pkwy, Suite 200, Norcross, GA 30093          **
//**                                                                        **
//**                          Phone (770)-246-8600                          **
//**                                                                        **
//****************************************************************************
//****************************************************************************
// $Header: /Alaska/BIN/Modules/Terminal/Terminal.uni 16    6/05/07 11:39p Ambikas $
//
// $Revision: 16 $
//
// $Date: 6/05/07 11:39p $
//**********************************************************************
// Revision History
// ----------------
// $Log: /Alaska/BIN/Modules/Terminal/Terminal.uni $
//
// 7     6/04/2007 7:27p Ambikas
//  "OS Console Redirection" strings are now "Out-of-band Management" strings.  
//  Increased the max num of Pci Serial Ports to 4 and so added strings for them.  
//
// 6     5/29/2007 8:33p Ambikas
// 
// 5     5/24/2007 2:33p Ambikas
// 
// 4     3/30/2007 5:18p Robert
// updating strings
// 
// 3     8/15/2006 11:18p Ambikas
// 
// 2     5/05/2006 5:34p Ambikas
//
// 1     11/11/2005 2:07p Ambikas
//
//**********************************************************************
//<AMI_FHDR_START>
//
// Name: Terminal.uni
//
// Description: Contains the unicode string definitions for the strings 
//              in Terminal.sd.
//
//<AMI_FHDR_END>
//**********************************************************************

/=#
#include "VFR.uni"

#string STR_NONE                            #language eng  "None"

#string STR_BLANK                           #language eng  ""

#string STR_TERMINAL_FORM_TITLE             #language eng  "Serial Port Console Redirection"

#string STR_CONSOLE_REDIRECTION_SETTINGS    #language eng  "Console Redirection Settings"
#string STR_CONSOLE_REDIRECTION_SETTINGS_HELP #language eng  "The settings specify how the host computer and the remote computer (which the user is using) will exchange data. Both computers should have the same or compatible settings."

#string STR_CONSOLE_REDIRECTION             #language eng  "Console Redirection"
#string STR_CONSOLE_REDIRECTION_ENABLE_HELP #language eng  "Console Redirection Enable or Disable."

#string STR_NO_SERIAL_PORTS_PRESENT         #language eng  "No Serial Ports Present"

#string STR_PORT_IS_DISABLED                #language eng  "Port Is Disabled"

#string STR_SIO_SERIAL_PORT0                #language eng  "COM0"
#string STR_SIO_SERIAL_PORT1                #language eng  "COM1"
#string STR_SIO_SERIAL_PORT2                #language eng  "COM2"
#string STR_SIO_SERIAL_PORT3                #language eng  "COM3"
#string STR_SIO_SERIAL_PORT4                #language eng  "COM4"
#string STR_SIO_SERIAL_PORT5                #language eng  "COM5"
#string STR_SIO_SERIAL_PORT6                #language eng  "COM6"
#string STR_SIO_SERIAL_PORT7                #language eng  "COM7"
#string STR_SIO_SERIAL_PORT8                #language eng  "COM8"
#string STR_SIO_SERIAL_PORT9                #language eng  "COM9"

#string STR_PCI_SERIAL_PORT0                #language eng  ""   //dynamically updated
#string STR_PCI_SERIAL_PORT1                #language eng  ""   //dynamically updated
#string STR_PCI_SERIAL_PORT2                #language eng  ""   //dynamically updated
#string STR_PCI_SERIAL_PORT3                #language eng  ""   //dynamically updated

#string STR_TERMINAL_TYPE                   #language eng  "Terminal Type"
#string STR_TERMINAL_TYPE_HELP              #language eng  "Emulation: ANSI: Extended ASCII char set. VT100: ASCII char set. VT100+: Extends VT100 to support color, function keys, etc. VT-UTF8: Uses UTF8 encoding to map Unicode chars onto 1 or more bytes."

#string STR_VT100                           #language eng  "VT100"
#string STR_VT100_PLUS                      #language eng  "VT100+"
#string STR_VT_UTF8                         #language eng  "VT-UTF8"
#string STR_ANSI                            #language eng  "ANSI"

#string STR_BAUD_RATE                       #language eng  "Bits per second"
#string STR_BAUD_RATE_HELP                  #language eng  "Selects serial port transmission speed. The speed must be matched on the other side. Long or noisy lines may require lower speeds."

#string STR_9600                            #language eng  "9600"   
#string STR_19200                           #language eng  "19200"
#string STR_57600                           #language eng  "57600"
#string STR_38400                           #language eng  "38400"
#string STR_115200                          #language eng  "115200"

#string STR_DATA_BITS                       #language eng  "Data Bits"
#string STR_DATA_BITS_HELP                  #language eng  "Data Bits"

#string STR_7                               #language eng  "7"
#string STR_8                               #language eng  "8"

#string STR_PARITY                          #language eng  "Parity"
#string STR_PARITY_HELP                     #language eng  "A parity bit can be sent with the data bits to detect some transmission errors. Even: parity bit is 0 if the num of 1's in the data bits is even. Odd: parity bit is 0 if num of 1's in the data bits is odd.  Mark: parity bit is always 1. Space: Parity bit is always 0. Mark and Space Parity do not allow for error detection. They can be used as an additional data bit."

#string STR_ODD                             #language eng  "Odd"
#string STR_EVEN                            #language eng  "Even"
#string STR_MARK                            #language eng  "Mark"
#string STR_SPACE                           #language eng  "Space"

#string STR_STOP_BITS                       #language eng  "Stop Bits"
#string STR_STOP_BITS_HELP                  #language eng  "Stop bits indicate the end of a serial data packet. (A start bit indicates the beginning). The standard setting is 1 stop bit. Communication with slow devices may require more than 1 stop bit."

#string STR_1                               #language eng  "1"
#string STR_2                               #language eng  "2"

#string STR_FLOW_CTRL                       #language eng  "Flow Control"
#string STR_FLOW_CTRL_HELP                  #language eng  "Flow control can prevent data loss from buffer overflow. When sending data, if the receiving buffers are full, a 'stop' signal can be sent to stop the data flow. Once the buffers are empty, a 'start' signal can be sent to re-start the flow. Hardware flow control uses two wires to send start/stop signals."
#string STR_HARDWARE_FLOW_CTRL              #language eng  "Hardware RTS/CTS"
#string STR_SOFTWARE_FLOW_CTRL              #language eng  "Software Xon/Xoff"

#string STR_LOOPBACK_ENABLE                 #language eng  "Enable Loopback"
#string STR_LOOPBACK_ENABLE_HELP            #language eng  "Enable Loopback"
#string STR_HARDWARE_LOOPBACK               #language eng  "Hardware Loopback"
#string STR_SOFTWARE_LOOPBACK               #language eng  "Software Loopback"

#string STR_SERIAL_PORT_FOR_OUT_OF_BAND_MGMT    #language eng  "Serial Port for Out-of-Band Management/"
#string STR_NO_SERIAL_PORT_FOR_OUT_OF_BAND_MGMT #language eng  "No Serial Port for Out-of-Band Management/"
#string STR_EMERGENCY_MANAGEMENT_SERIVCES_EMS   #language eng "Windows Emergency Management Services (EMS)"

#string STR_OUT_OF_BAND_MANAGEMENT_PORT         #language eng  "Out-of-Band Mgmt Port"  
#string STR_OUT_OF_BAND_MANAGEMENT_PORT_HELP    #language eng  "Microsoft Windows Emergency Management Services (EMS) allows for remote management of a Windows Server OS through a serial port."

#string STR_OUT_OF_BAND_MGMT_TERMINAL_TYPE_HELP #language eng   "VT-UTF8 is the preferred terminal type for out-of-band management. The next best choice is VT100+ and then VT100. See above, in Console Redirection Settings page, for more Help with Terminal Type/Emulation."
#string STR_TERMINAL_RESOLUTION                 #language eng   "Resolution 100x31"
#string STR_TERMINAL_RESOLUTION_HELP            #language eng   "Enables or disables extended terminal resolution"
#string STR_LEGACYOS_RESOLUTION                 #language eng   "Legacy OS Redirection Resolution"
#string STR_LEGACYOS_RESOLUTION_HELP            #language eng   "On Legacy OS, the Number of Rows and Columns supported redirection"
#string STR_80_24                               #language eng   "80x24"
#string STR_80_25                               #language eng   "80x25"
#string STR_100_31                              #language eng   "100x31"
#string STR_TERMINAL_VTUTF8                     #language eng   "VT-UTF8 Combo Key Support"
#string STR_TERMINAL_VTUTF8_HELP                #language eng   "Enable VT-UTF8 Combination Key Support for ANSI/VT100 terminals"
#string STR_TERMINAL_RECORDER_MODE              #language eng   "Recorder Mode"
#string STR_TERMINAL_RECORDER_MODE_HELP         #language eng   "With this mode enabled only text will be sent. This is to capture Terminal data."
#string STR_DEBUGGER_TERMINAL                   #language eng   "Redirection Via AMI Debugger"
#string STR_DEBUGGER_TERMINAL_TYPE              #language eng   "Terminal Type"
#string STR_DEBUGGER_TERMINAL_TYPE_HELP         #language eng   "Terminal Type for Redirection Via AMI Debugger. Emulation: ANSI: Extended ASCII char set. VT100: ASCII char set. VT100+: Extends VT100 to support color, function keys, etc. VT-UTF8: Uses UTF8 encoding to map Unicode chars onto 1 or more bytes."
#string STR_TERMINAL_RECORDER_MODE              #language eng   "Recorder Mode"
#string STR_TERMINAL_RECORDER_MODE_HELP         #language eng   "On this mode enabled only text will be send. This is to capture Terminal data."
#string STR_PUTTYFUNCTION_KEYPAD                #language eng   "Putty KeyPad"
#string STR_PUTTYFUNCTION_KEYPAD_HELP           #language eng   "Select FunctionKey and KeyPad on Putty."
#string STR_LINUX                               #language eng   "LINUX"
#string STR_XTERMR6                             #language eng   "XTERMR6"
#string STR_SCO                                 #language eng   "SCO"
#string STR_ESCN                                #language eng   "ESCN"
#string STR_VT400                               #language eng   "VT400"
#string STR_FORCE_SYSTEM_VGA_TO_TEXT_MODE       #language eng   "Install Legacy OS through Remote"
#string STR_FORCE_SYSTEM_VGA_TO_TEXT_MODE_HELP  #language eng   "Enable to Install Legacy OS like Linux in text/graphics mode through redirection When System has Vga. This might not work for all Linux Versions."

#string STR_REDIRECTION_AFTER_BIOS_POST         #language eng   "Redirection After BIOS POST"
#string STR_REDIRECTION_AFTER_BIOS_POST_HELP    #language eng   "The Settings specify if BootLoader is selected than Legacy console redirection is disabled before booting to Legacy OS. Default value is Always Enable which means Legaacy console Redirection is enabled for Legacy OS. "

#string STR_ALWAY_ENABLE                        #language eng   "Always Enable"
#string STR_BOOTLOADER                          #language eng   "BootLoader"

#string STR_LEGACY_CONSOLE_REDIRECTION          #language eng   "Legacy Console Redirection"
#string STR_LEGACY_CONSOLE_REDIRECTION_SETTINGS #language eng   "Legacy Console Redirection Settings"
#string STR_COM_FOR_LEGACY_REDIRECTION          #language eng   "Legacy Serial Redirection Port"
#string STR_COM_FOR_LEGACY_REDIRECTION_HELP     #language eng   "Select a COM port to display redirection of Legacy OS and Legacy OPROM Messages"
//****************************************************************************
//****************************************************************************
//**                                                                        **
//**             (C)Copyright 1985-2014, American Megatrends, Inc.          **
//**                                                                        **
//**                          All Rights Reserved.                          **
//**                                                                        **
//**             5555 Oakbrook Pkwy, Suite 200, Norcross, GA 30093          **
//**                                                                        **
//**                          Phone (770)-246-8600                          **
//**                                                                        **
//****************************************************************************
//****************************************************************************